/************************************************************************
 *
 *     Project:  Windows Sample Applications
 *
 *      Module:  status.c
 *
 *   Author(s):  Charles E. Kindel, Jr. (charlkin)
 *
 *     Remarks:
 *       This module contains all functions used to display a 3d looking
 *       status line (window) within a parent window. 
 *
 *   Revisions:  
 *     01.00.000  9/25/91 cek   Made into a sample
 *     02.00.000  1/3/92  cek   Make compatible with Win32
 *
 ************************************************************************/

#ifdef STANDALONE
   #define _WINDLL
   #define STRICT

   #include <windows.h>
   #include <windowsx.h>

   #ifdef WIN32
      #include <strict.h>
      #include <malloc.h>
   #endif

   #include <wdb.h>
   #include "status.h"
   #include <3dutil.h>

#else
   #include "shoplibi.h"
   #define IN_A_DLL
#endif

/*************************************************************************
 * Local Defines                                      
 *************************************************************************/

#define MAX_STATLEN  128

//
// The handle that is passed to CreateMsgWindow is stored in the 
// cbWndExtra part of the child window.  This flag is used to 
// retrieve that data:
//
#define NUM_EXTRABYTES (sizeof(LPVOID) + sizeof(LONG) + sizeof(HFONT))

#define GWL_LPSTATUS   0 
#define GWL_FLAGS      (GWL_LPSTATUS + sizeof(LPVOID))
#define GWW_HFONT      (GWL_FLAGS + sizeof(LONG))

#define LINEWIDTH      ((int)1)

#define SW_ERR         ((LRESULT)(-1))

/*************************************************************************
 * Macros                                      
 *************************************************************************/
#define ISDIGIT(c)  ((c) >= '0' && (c) <= '9')

/*
 * These macros all act on window longs.  They will all work in both
 * Win16 and Win32.
 */
#define GETSTYLE(hWnd)        LOWORD( GetWindowLong( hWnd, GWL_STYLE ) )
#define GETFLAGS(hWnd)        GetWindowLong( hWnd, GWL_FLAGS )
#define SETFLAGS(hWnd,l)      SetWindowLong( hWnd, GWL_FLAGS, l )

#define GETLPSTATUS(hWnd)     (LPSTATUS)GetWindowLong( hWnd, GWL_LPSTATUS )
#define SETLPSTATUS(hWnd,lp)  (LPSTATUS)SetWindowLong( hWnd, GWL_LPSTATUS, (LONG)lp )

/*
 * Since the size of HFONT and HINSTANCE change between 16 and 32 we
 * need different macros
 */
#ifndef WIN32
   #define GETHINST(hwnd)     (HINSTANCE)GetWindowWord( hwnd, GWW_HINSTANCE )
   #define GETHFONT(hWnd)     (HFONT)GetWindowWord( hWnd, GWW_HFONT )
   #define SETHFONT(hWnd,hf)  (HFONT)SetWindowWord( hWnd, GWW_HFONT, (WORD)hf )

   #define GETID(hWnd)        (WORD)GetWindowWord( hWnd, GWW_ID ) 
   
   #define GALLOC(cb)         GlobalAllocPtr( GHND, cb )
   #define GFREE(lp)          GlobalFreePtr( lp )
#else
   #define GETHINST(hwnd)     (HINSTANCE)GetWindowLong( hwnd, GWL_HMODULE )
   #define GETHFONT(hWnd)     (HFONT)GetWindowLong( hWnd, GWW_HFONT )
   #define SETHFONT(hWnd,hf)  (HFONT)SetWindowLong( hWnd, GWW_HFONT, (LONG)hf )

   #define GETID(hWnd)        (WORD)GetWindowLong( hWnd, GWL_ID ) 

   #define GALLOC(cb)         malloc(cb)
   #define GFREE(lp)          free(lp)
#endif


/************************************************************************
 * Local data structures
 ************************************************************************/

//
// MSG/STATLINE data structures
//
// Structure for msg line
typedef struct tagSTATUS
{
/* 2  */ WORD   wNumStats ;    // Number of status boxes
/* 10 */ RECT     rect ;         // coordinates of MsgLineWnd
/* 14 */ COLORREF rgbColor ;     // Text color
/* 16 */ WORD   wJustify ;
/* 18 */ BOOL     fBorder ;
/* 20 */ BOOL     fTouched ;     // TRUE if CurMSg has changed since last
/* 22 */ BOOL     fNoMsg ;
/* 24 */ GLOBALHANDLE hszDefault ;
                                    // WM_PAINT
} STATUS, *PSTATUS, FAR *LPSTATUS ;

// structure for status boxes
typedef struct tagSTATBOX
{
/* 8  */ RECT     rect ;                  // coordinates of Stat Box
/* 12 */ COLORREF rgbColor ;              // Color of text
/* 14 */ LONG     wWidth ;                // Width of box in pixels
/* 142*/ char     szCurStat[MAX_STATLEN] ;             // Current status
/* 144*/ WORD   wJustify ;
/* 146*/ BOOL     fBorder  ;
/* 148*/ BOOL     fTouched ;          // TRUE if CurStat has changed since
                                    // last WM_PAINT
} STATBOX, *PSTATBOX, FAR *LPSTATBOX ;


/************************************************************************
 * Internal APIs and data structures for MSG/STATLINES
 ************************************************************************/
static BOOL NEAR PASCAL IsRectInRect( LPRECT lpR1, LPRECT lpR2 ) ;

static BOOL NEAR PASCAL StatusCreate( HWND hWnd, LPCREATESTRUCT lp ) ;

/*
 * wID is always 16 bits since it must be packed in wParam or lParam as
 * a notification code.
 */
static void NEAR PASCAL StatusInvalidate( HWND hWnd, WORD wID ) ;

static void NEAR PASCAL StatusPaint( HWND hWnd ) ;

static BOOL NEAR PASCAL CheckClick( HWND, LPARAM, LPWORD ) ;

static int NEAR PASCAL StatGetWidth( HWND hWnd, LPSTR lpszText ) ;

LRESULT WINAPI
fnStatus( HWND hWnd, UINT wMsg, WPARAM wParam, LPARAM lParam ) ;

#if 0
